{
    "version": "https://jsonfeed.org/version/1",
    "title": "Bhargav Singapuri Blog",
    "home_page_url": "https://majulahsingapuri.github.io/blog",
    "description": "Bhargav Singapuri Blog",
    "items": [
        {
            "id": "https://majulahsingapuri.github.io/blog/django-ninja-auth",
            "content_html": "<p>Creating the perfect (imo at least) REST authentication system for Django Ninja</p>\n<p>Hello one and all and welcome back to another update!\nI hope you are all having a wonderful holiday season.</p>\n<h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"why-start-a-new-project\">Why Start a New Project<a href=\"https://majulahsingapuri.github.io/blog/django-ninja-auth#why-start-a-new-project\" class=\"hash-link\" aria-label=\"Direct link to Why Start a New Project\" title=\"Direct link to Why Start a New Project\">​</a></h2>\n<p>In the process of creating my auth server, I have decided to do a little side quest and expand upon an <a href=\"https://eadwincode.github.io/django-ninja-jwt/\" target=\"_blank\" rel=\"noopener noreferrer\">exisiting library</a> for authentication in Django Ninja REST framework called <code>django-ninja-jwt</code>.\nWhy would I do such a thing?\nIsn't there already too much on my plate that I have to go and add on a new project?</p>\n<p>Firstly, yes.\nI do have too many projects on my plate, considering that an auth server is just the first step in the process.\nI still have to create the whole personal finance app, or whatever I end up creating in the end.\nBut at the same time, I personally have been pretty frustrated with the lack of REST authentication options for Django Ninja.\nYes, the base library provides a decent start for Session, Cookie and token authentication, it is not as robust as Django REST Framework.</p>\n<h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"why-django-ninja-jwt\">Why Django-Ninja-JWT<a href=\"https://majulahsingapuri.github.io/blog/django-ninja-auth#why-django-ninja-jwt\" class=\"hash-link\" aria-label=\"Direct link to Why Django-Ninja-JWT\" title=\"Direct link to Why Django-Ninja-JWT\">​</a></h2>\n<p>The library that I ended up forking does provide great support for JWT authentication but does not support any other kinds of cookie authentication.\nBut what it did have is a great system for customisations to the controllers and schemas as well as a working JWT authentication system that is symmetric to <a href=\"https://github.com/iMerica/dj-rest-auth\" target=\"_blank\" rel=\"noopener noreferrer\">Django REST Auth</a>.\nHence, all I had to do was to port over the Token Authentication capability from DRA and add in the basic session authentication functionality and we are golden.</p>\n<p>While I did remove some of the functionality from the JWT part of the project, namely the token blacklisting and routers for simplicity's sake, it is not difficult to re-incorporate it back into the project.\nThe key thing was to ensure that it had compatibility with Pydantic's v2 API while maintianing the same functionality.</p>\n<p>What I also liked from the DRA and Ninja JWT libraries is that there sub-apps that extend the base app's functionality.\nFor DRA it is the <code>authtoken</code> app and for Ninja JWT it is the <code>blacklist</code> app.\nThis means that all I have to do is to keep the core authentication logic in the main app and add any other logic like checking of tokens and creating refresh endpoints in sub-apps.\nThis ensures that there is a top-down hierarchy and developers only use what they need.</p>\n<p>What I ended up with is the <a href=\"https://pypi.org/project/dj-ninja-auth/\" target=\"_blank\" rel=\"noopener noreferrer\">following</a> library.</p>\n<p><img decoding=\"async\" loading=\"lazy\" alt=\"dj-ninja-auth project page\" src=\"https://majulahsingapuri.github.io/assets/images/dj-ninja-auth-project-page-3ab6f93d6ebcbe6adcf1fbbd60113693.png\" width=\"1146\" height=\"655\" class=\"img_ev3q\"></p>\n<h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"next-steps\">Next Steps<a href=\"https://majulahsingapuri.github.io/blog/django-ninja-auth#next-steps\" class=\"hash-link\" aria-label=\"Direct link to Next Steps\" title=\"Direct link to Next Steps\">​</a></h2>\n<p>Using an email and password for authentication is so old school.\nWhere is the good stuff? We need social authentication and since security is also important, we need to add in MFA.\nLuckily, <a href=\"https://github.com/pennersr/django-allauth/tree/main\" target=\"_blank\" rel=\"noopener noreferrer\">Allauth</a> already provides these functionalities, albeit for apps that are fully managed by Django rather than being on the REST architecture.\nThis means that there will have to be some tweaking and bodging that has to be done in order to allow this to work properly.</p>\n<h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"goal\">Goal<a href=\"https://majulahsingapuri.github.io/blog/django-ninja-auth#goal\" class=\"hash-link\" aria-label=\"Direct link to Goal\" title=\"Direct link to Goal\">​</a></h2>\n<p>At the end of the day, my goal for this project is for it to be a fully fledged authentication system that provides support for all kinds of authentication, be it username/password or social and with MFA support built on JWTs or rotating Auth tokens.</p>\n<h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"what-you-can-do\">What You can Do<a href=\"https://majulahsingapuri.github.io/blog/django-ninja-auth#what-you-can-do\" class=\"hash-link\" aria-label=\"Direct link to What You can Do\" title=\"Direct link to What You can Do\">​</a></h2>\n<p>Every open source project needs time and manpower to keep up to date.\nThis repository is already 2 departed from the original SimpleJWT library and me being the only contributor will take considerable effort on my end.\nIf you find this library useful, want to get started with open source or think there are ways that I can improve the code (workflows, actions, tests) then do feel free to create PRs and help expand this project.</p>\n<p>Thank you for your time and I hope you learnt something!</p>",
            "url": "https://majulahsingapuri.github.io/blog/django-ninja-auth",
            "title": "Side Quest: An Auth System for Django Ninja",
            "summary": "A REST Authentication System for the Django Ninja Framework",
            "date_modified": "2023-12-12T00:00:00.000Z",
            "author": {
                "name": "Bhargav Singapuri",
                "url": "https://github.com/majulahsingapuri"
            },
            "tags": [
                "backend",
                "django",
                "django-ninja",
                "authentication",
                "python"
            ]
        },
        {
            "id": "https://majulahsingapuri.github.io/blog/personal-expenses-pt-3",
            "content_html": "<p>It's been a long while coming but there is progress...</p>\n<p>First and foremost, apologies for the long delay in this post.\nI have been inundated with Diwali celebrations and other work commitments.\nThis is still a side project for me and it will take some time to get done but thank you all for joining along on this journey.\nNow let's run through some of the major changes that have happened in the project.</p>\n<h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"url-resolution\">URL Resolution<a href=\"https://majulahsingapuri.github.io/blog/personal-expenses-pt-3#url-resolution\" class=\"hash-link\" aria-label=\"Direct link to URL Resolution\" title=\"Direct link to URL Resolution\">​</a></h2>\n<p>In the last update, I was using Bind9 as the nameserver to resolve local domain names to the server running my application and <a href=\"https://caddyserver.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Caddy</a> to reverse proxy the applications in my Docker environment.\nA flow of how that works is shown in the diagram below.</p>\n<p><img decoding=\"async\" loading=\"lazy\" alt=\"Status thus far\" src=\"https://majulahsingapuri.github.io/assets/images/status-thus-far-711ba853e67e2cba535733e04f4dda92.png\" width=\"1454\" height=\"632\" class=\"img_ev3q\"></p>\n<p>Unfortunately - if you remember from the last update - I was having issues resolving my domains with my Bind9 server.\nIn hindsight I think it was probably because it was not an authoritative nameserver, which I <a href=\"https://kb.porkbun.com/article/63-how-to-switch-to-porkbuns-nameservers\" target=\"_blank\" rel=\"noopener noreferrer\">later found out</a> I have to declare on the Porkbun site.</p>\n<p>To keep things simpler, and not have to wrestle with more complexity in the system, I decided to use Porkbun's DNS records as per normal to resolve domain names and Caddy to reverse proxy the requests to the correct container.\nThis way, I can still update records on the fly as Caddy can be quickly hot-reloaded and it gives me the added benefit of SSL/TLS encryption as elaborated in the next section.</p>\n<p>Thus my DNS resolution flow looks as such</p>\n<p><img decoding=\"async\" loading=\"lazy\" alt=\"New URL resolution\" src=\"https://majulahsingapuri.github.io/assets/images/new-url-resolution-1aafe59e4cc169f6fefdb8d2061b00ff.png\" width=\"1454\" height=\"665\" class=\"img_ev3q\"></p>\n<p>Additionally, I had to add a wildcard DNS record using the Porkbun website to resolve all <code>*.local.bhargav.io</code> domains to <code>192.168.79.19</code>, where Caddy will then take care of the reverse proxying.</p>\n<p><img decoding=\"async\" loading=\"lazy\" alt=\"DNS entries\" src=\"https://majulahsingapuri.github.io/assets/images/dns-entries-920506c6cd3be53b79807e1946d445f6.png\" width=\"846\" height=\"447\" class=\"img_ev3q\"></p>\n<h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"secure-socket-layer\">Secure Socket Layer<a href=\"https://majulahsingapuri.github.io/blog/personal-expenses-pt-3#secure-socket-layer\" class=\"hash-link\" aria-label=\"Direct link to Secure Socket Layer\" title=\"Direct link to Secure Socket Layer\">​</a></h2>\n<p>Ever wonder why there is a lock icon next to any URL that you type in your browser? It shows that your connection to the server is secure and the data that is being transmitted and received is encrypted.\nIt also gives your browser the assurance that the server is who it says it is.</p>\n<p>For more information you can read up on <a href=\"https://www.cloudflare.com/en-gb/learning/ssl/what-is-ssl/\" target=\"_blank\" rel=\"noopener noreferrer\">this Cloudflare article</a> for a primer but the important thing to note is that the server has a certificate signed by a trusted authority (CA) that has a public key which the client uses to encrypt data and a private key that the server uses to decrypt data.</p>\n<p><img decoding=\"async\" loading=\"lazy\" alt=\"SSL explanation\" src=\"https://majulahsingapuri.github.io/assets/images/ssl-explainer-9fa6da3fd3f23851740592123f0aa8cd.png\" width=\"1667\" height=\"1113\" class=\"img_ev3q\"></p>\n<p>In our case, my domain registrar has <a href=\"https://porkbun.com/api/json/v3/documentation#SSL%20Retrieve%20Bundle%20by%20Domain\" target=\"_blank\" rel=\"noopener noreferrer\">API endpoints</a> that allow for a reverse proxy or some similar software to get these certificates rather than storing the certificates and having to renew them every year and manually upload them to the server in question.\nI am using Caddy as my reverse proxy and it provides this <a href=\"https://github.com/caddy-dns/porkbun\" target=\"_blank\" rel=\"noopener noreferrer\">handy bit of code</a> to encrypt all my communications on my local network.</p>\n<p>Now the flow of loading the login page of my authentication server looks like the following.</p>\n<p><img decoding=\"async\" loading=\"lazy\" alt=\"SSL URL resolution\" src=\"https://majulahsingapuri.github.io/assets/images/ssl-url-resolution-a4078abf3353cc07eb603f7dc9e9a1bb.png\" width=\"1414\" height=\"636\" class=\"img_ev3q\"></p>\n<p>It is definitely more complex than before but now with the added benefit of being a secure connection.\nFinally, we have an authenticated login page.</p>\n<p><img decoding=\"async\" loading=\"lazy\" alt=\"SSL homepage\" src=\"https://majulahsingapuri.github.io/assets/images/ssl-homepage-f11ff982fccd3c5a2cf21d04e4ccf108.png\" width=\"1920\" height=\"936\" class=\"img_ev3q\"></p>\n<h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"authentication\">Authentication<a href=\"https://majulahsingapuri.github.io/blog/personal-expenses-pt-3#authentication\" class=\"hash-link\" aria-label=\"Direct link to Authentication\" title=\"Direct link to Authentication\">​</a></h2>\n<p>Let's say that now we have built up the authentication page that allows the user to sign in on our auth subdomain, how do we ensure that this authentication stays intact on another subdomain such as <code>app.local.bhargav.io</code>? How do we also prove that the user is who they say they are?</p>\n<p>Since we have already established a secure connection with the server, we can in fact send credentials to the client so that the client can then use them in every subsequent request to the server and be considered authorised.</p>\n<h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"credentials\">Credentials<a href=\"https://majulahsingapuri.github.io/blog/personal-expenses-pt-3#credentials\" class=\"hash-link\" aria-label=\"Direct link to Credentials\" title=\"Direct link to Credentials\">​</a></h3>\n<p>There are 2 main kinds of authentication credentials that are commonly used.\nThe first is Cookies and the second is Tokens.\nGenerally these credentials are passed as a Header parameter in the Request but can also be passed in the body of the request if the server requests it as such.</p>\n<h4 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"cookies\">Cookies<a href=\"https://majulahsingapuri.github.io/blog/personal-expenses-pt-3#cookies\" class=\"hash-link\" aria-label=\"Direct link to Cookies\" title=\"Direct link to Cookies\">​</a></h4>\n<p>When authenticating with cookies, we generally use session cookies to determine the user and how long they can stay authenticated before they need to reauthenticate.\nThey are a great elementary way to ensure authentication but for the purposes of our app, where the user's session needs to be synced across multiple servers and subdomains, it adds complexity to the application.</p>\n<h4 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"tokens\">Tokens<a href=\"https://majulahsingapuri.github.io/blog/personal-expenses-pt-3#tokens\" class=\"hash-link\" aria-label=\"Direct link to Tokens\" title=\"Direct link to Tokens\">​</a></h4>\n<p>Tokens are a better way to enact a one-time authentication with a auth server and reuse that token across multiple other servers.\nThe auth server can provide a hexadecimal string that can be used to verify the user and it can also be refreshed at fixed expiry intervals to ensure that the user's data is not compromised if the token is.</p>\n<p>However, there is still an issue of syncing across multiple servers as the app server will need to check with the Authentication server if the Token is valid before allowing the user to proceed.\nThis also adds extra complexity for a multi-domain application and we need a solution that extends upon the token concept and removes the need for the Authorisation server to keep checking the Authentication of the user.</p>\n<h4 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"jwts\">JWTs<a href=\"https://majulahsingapuri.github.io/blog/personal-expenses-pt-3#jwts\" class=\"hash-link\" aria-label=\"Direct link to JWTs\" title=\"Direct link to JWTs\">​</a></h4>\n<p>JSON Web Tokens are a kind of token that is customisable to the developer's needs and contains extra information about the user and thier permissions.\nIt can also be encrypted and signed so that the server knows that the token has not been tampered with to gain unauthorised access.</p>\n<p>This is perfect for our use as the Authentication server can sign a JWT and return it to the user upon successful log in.\nThe user can then use the token in every subsequent request to the app server to prove it has the authorisation to access data.\nThe validity of the Token can even be checked by Caddy to ensure that unauthorised requests are being redirected to the Authentication server.\nThe app server can also see what are the permissions that the user has to conditionally render UI elements for the user and check API calls to ensure that the user has the right permissions to call the API.</p>\n<h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"storing-credentials\">Storing Credentials<a href=\"https://majulahsingapuri.github.io/blog/personal-expenses-pt-3#storing-credentials\" class=\"hash-link\" aria-label=\"Direct link to Storing Credentials\" title=\"Direct link to Storing Credentials\">​</a></h3>\n<p>Typically Credentials are stored as Javascript variables using libraries such as <code>axios</code>.\nHowever, we need to ensure that the tokens survive a page navigation to the app site once the user has been authenticated.\nHence we will use a mixture of tokens and cookies to ensure that the user stays authenticated until the token expires and will be forced to renew the token.</p>\n<p>Cookies have a domain field that determines what domains can access this cookie.\nBy setting it to a value such as <code>.local.bhargav.io</code>, we can ensure that the cookie is valid for all local subdomains that the user can access.\nFor full details on the cookie implementation, do check out the repository.</p>\n<h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"local-testing\">Local Testing<a href=\"https://majulahsingapuri.github.io/blog/personal-expenses-pt-3#local-testing\" class=\"hash-link\" aria-label=\"Direct link to Local Testing\" title=\"Direct link to Local Testing\">​</a></h2>\n<p>Now that we have the JWTs set up, how do we test it locally without having to repeatedly build the Docker containers.\nThe answer is to use a cheeky <code>localhost</code> subdomain that matches our actual domain structure.\nTypically, domains have a Top-Level Domain, such as <code>.com</code> or in my case, <code>.io</code>.\nlocalhost is also considered a TLD since there is nothing that comes after it.</p>\n<p>Thus to emulate how my application will run in \"production\", we can use a subdomain like <code>auth.local.localhost</code>.\nThis behaves in the same way my actual domain will behave and the best part is that there is no need to set up DNS servers and A records.\nYour machine will automatically resolve localhost domains to itself and all you need is reverse proxy to listen for this domain and reroute requests to the right servers running on your own machine.</p>\n<p><img decoding=\"async\" loading=\"lazy\" alt=\"Local Testing\" src=\"https://majulahsingapuri.github.io/assets/images/local-testing-3391e1fd18ae06288b3eb677263515fd.png\" width=\"1920\" height=\"1014\" class=\"img_ev3q\"></p>\n<p>This will also ensure that the cookies work as intended and we can also self-sign the TLS certificates to test how the app behaves using SSL.\nYour browser might complain a bit but that's fine.\nWe can also see that credentials are being stored when the user successfully authenticates and logs in.</p>\n<p><img decoding=\"async\" loading=\"lazy\" alt=\"Tokens in Browser\" src=\"https://majulahsingapuri.github.io/assets/images/tokens-5075ec169de2286ad114a4a2264470b0.png\" width=\"1920\" height=\"928\" class=\"img_ev3q\"></p>\n<h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"next-steps\">Next Steps<a href=\"https://majulahsingapuri.github.io/blog/personal-expenses-pt-3#next-steps\" class=\"hash-link\" aria-label=\"Direct link to Next Steps\" title=\"Direct link to Next Steps\">​</a></h2>\n<p>So there we have it folks, a working authentication page that on successful sign in will redirect us to an app page where we can still access the JWTs to use for further requests.</p>\n<p><img decoding=\"async\" loading=\"lazy\" alt=\"Profile Page\" src=\"https://majulahsingapuri.github.io/assets/images/profile-page-f12611be10c50a6de3dc0030064e16a5.png\" width=\"1920\" height=\"1014\" class=\"img_ev3q\"></p>\n<p>As stated last time, next steps involve creating GitHub actions that will automatically package and deploy my applications to the right servers.\nI had an issue with my Mac Mini not being able to turn on SSH and thus it was time to say goodbye to an old friend.\nPerhaps in the future I will have a seperate and better computer that is capable of hadling the tasks that I need it to and we will be off to the races.</p>\n<p>If you found this post interesting, do share it with friends!</p>",
            "url": "https://majulahsingapuri.github.io/blog/personal-expenses-pt-3",
            "title": "Personal Expenses Pt. 3",
            "summary": "Part 3 of the Personal Expenses tracker application project.",
            "date_modified": "2023-12-01T00:00:00.000Z",
            "author": {
                "name": "Bhargav Singapuri",
                "url": "https://github.com/majulahsingapuri"
            },
            "tags": [
                "infrastructure",
                "architecture",
                "payments",
                "frontend",
                "backend"
            ]
        },
        {
            "id": "https://majulahsingapuri.github.io/blog/personal-expenses-pt-2",
            "content_html": "<p>Success!\nWell... Sort of.</p>\n<h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"intro\">Intro<a href=\"https://majulahsingapuri.github.io/blog/personal-expenses-pt-2#intro\" class=\"hash-link\" aria-label=\"Direct link to Intro\" title=\"Direct link to Intro\">​</a></h2>\n<p>Over the weekend, I finally had some time to get started (and stuck) on the project.\nMost of it was just getting the basics set up and running, things like git repos and router DNS/DHCP settings.\nSince this is the first time I am doing such a project, my goal for the end of the weekend was to be able to serve a Next.Js page using my personal sub-domain name over my LAN.</p>\n<p>I shall attempt to write these posts for someone that has zero idea of how such networking things work (me 3 weeks ago basically) and bring you along my thought processes and the steps that I took to get to where I am in the project currently.</p>\n<p>I will assume basic knowledge in things like what is an IP address, domain name and how to navigate your router's settings.\nI will also be linking resources that I have used to keep this as brief as possible.</p>\n<h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"router\">Router<a href=\"https://majulahsingapuri.github.io/blog/personal-expenses-pt-2#router\" class=\"hash-link\" aria-label=\"Direct link to Router\" title=\"Direct link to Router\">​</a></h2>\n<h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"why-start-here\">Why Start Here<a href=\"https://majulahsingapuri.github.io/blog/personal-expenses-pt-2#why-start-here\" class=\"hash-link\" aria-label=\"Direct link to Why Start Here\" title=\"Direct link to Why Start Here\">​</a></h3>\n<p>The router is what contains the 2 key parts of the project that will eventually allow you to use a domain name to reach your server rather than using an IP address.</p>\n<ul>\n<li>\n<p>DHCP (Dynamic Host Configuration Protocol) Server: this allows your router to dynamically assign local IP addresses to your devices.\nThe router \"leases\" that address to you device for a set time (usually 24 hours) before it reassigns it.\nThis ensures that there are always local IP addresses on your nework for new devices to join to.</p>\n</li>\n<li>\n<p>DNS (Domain Name System) Server: this service converts domain names - example.com - to IP addresses.\nThis makes things easier for us since we can easily remember words not a series of numbers.\nMost routers will have a setting for you to define which DNS servers to use as default.</p>\n</li>\n</ul>\n<h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"router-goal\">Goal<a href=\"https://majulahsingapuri.github.io/blog/personal-expenses-pt-2#router-goal\" class=\"hash-link\" aria-label=\"Direct link to Goal\" title=\"Direct link to Goal\">​</a></h3>\n<p>What we need to do is to give our server that hosts our applications (host server) a fixed IP address so that we do not have to keep reassigning new IP addresses to our domain name.\nWe also need to use a DNS server to to map our domain name to the host server's IP address.</p>\n<h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"router-steps\">Steps<a href=\"https://majulahsingapuri.github.io/blog/personal-expenses-pt-2#router-steps\" class=\"hash-link\" aria-label=\"Direct link to Steps\" title=\"Direct link to Steps\">​</a></h3>\n<p>Firstly, we need to \"reserve\" an IP address for our host server.\nLuckily most routers come with a setting called DCHP Reservation that allows us to do just that.\nYour router will list all the currently connected devices and their associated MAC and IP addresses as shown below.\nRefer to your router's manual for how to reserve IP addresses.</p>\n<table><thead><tr><th style=\"text-align:center\"><img decoding=\"async\" loading=\"lazy\" alt=\"DCHP Reservation\" src=\"https://majulahsingapuri.github.io/assets/images/dhcp-server-02bb346d28490a6e029b182de6f2e644.png\" width=\"1173\" height=\"962\" class=\"img_ev3q\"></th></tr></thead><tbody><tr><td style=\"text-align:center\"><strong>DCHP Reservation</strong></td></tr></tbody></table>\n<p>Now that our computer has a fixed (static) IP address, it will forever be reachable at this address even if the computer disconnects and reconnects to the network at a later time.</p>\n<p>Second, the DNS server.\nWe will get to setting up the server later on, but first we need to decide where the DNS server is running.\nSome routers come with a DNS server built in, which makes this whole process a lot easier, while for most you have to set one up yourself.</p>\n<p>For my router, a Linksys E9450, it does not come with a DNS server and by default takes whatever is set on the WAN (which in my case will be my Internet Service Provider's (ISP) DNS server.\nIt also has a setting for me to set primary and secondary DNS servers manually which is what I used for my setup.</p>\n<p>I decided to run my DNS server on the same host server as my applications, just to make things simpler.\nThus, I set the static DNS addresses on the router as the following:</p>\n<ul>\n<li>\n<p>Primary: 8.8.8.8 which is Google's DNS server</p>\n</li>\n<li>\n<p>Secondary: 192.168.79.19 which is my computer's local IP address.</p>\n</li>\n</ul>\n<p>The router will send any DNS queries that fail to be resolved to my DNS server.</p>\n<p>Like what you are reading thus far? Consider becoming a subscriber and stay up to date on my tinkering.</p>\n<h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"dns-server\">DNS Server<a href=\"https://majulahsingapuri.github.io/blog/personal-expenses-pt-2#dns-server\" class=\"hash-link\" aria-label=\"Direct link to DNS Server\" title=\"Direct link to DNS Server\">​</a></h2>\n<h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"dns-goal\">Goal<a href=\"https://majulahsingapuri.github.io/blog/personal-expenses-pt-2#dns-goal\" class=\"hash-link\" aria-label=\"Direct link to Goal\" title=\"Direct link to Goal\">​</a></h3>\n<p>Now that we have a static address for the DNS Server as well as the host server, we need to let the DNS server know where to find the host server.\nFor now they are both the same but that might not be the case in the future or for you.\nWe will have to insert an 'A' Record which maps a URL to an IPv4 address.\nSimilarly, there is also an 'AAAA' record that does the same with IPv6 addresses but we are keeping things simple here.</p>\n<h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"dns-steps\">Steps<a href=\"https://majulahsingapuri.github.io/blog/personal-expenses-pt-2#dns-steps\" class=\"hash-link\" aria-label=\"Direct link to Steps\" title=\"Direct link to Steps\">​</a></h3>\n<p>I followed the tutorial by Christian Lempa which uses a Bind9 server running in Docker to handle the DNS functionality.\nThis might be a bit overkill for most of us but I think its a good stepping stone going forward.\nAs he also mentions in his follow-up video, he extends the setup to use Terraform to dynamically add new entries to the DNS server and manage the records that are currently present.</p>\n<p>His tutorial is pretty easy and straightforward to follow, but if you want to see what I have done with my setup, you can refer to my networking repository.\nI have left out the access control list portion for now but may reinstate it in the future depending on my needs.</p>\n<h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"webpage\">Webpage<a href=\"https://majulahsingapuri.github.io/blog/personal-expenses-pt-2#webpage\" class=\"hash-link\" aria-label=\"Direct link to Webpage\" title=\"Direct link to Webpage\">​</a></h2>\n<h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"webpage-goal\">Goal<a href=\"https://majulahsingapuri.github.io/blog/personal-expenses-pt-2#webpage-goal\" class=\"hash-link\" aria-label=\"Direct link to Goal\" title=\"Direct link to Goal\">​</a></h3>\n<p>Now that our client devices (any other device on the network) can find our host server using a URL, in my case with the *.local.bhargav.io endpoints, we need to serve something from the host server for clients to see.\nSince I will be making a Next.js application, I just wanted them to be able to see the default splash screen of the framework when it is first installed.</p>\n<h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"webpage-steps\">Steps<a href=\"https://majulahsingapuri.github.io/blog/personal-expenses-pt-2#webpage-steps\" class=\"hash-link\" aria-label=\"Direct link to Steps\" title=\"Direct link to Steps\">​</a></h3>\n<h4 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"caddy\">Caddy<a href=\"https://majulahsingapuri.github.io/blog/personal-expenses-pt-2#caddy\" class=\"hash-link\" aria-label=\"Direct link to Caddy\" title=\"Direct link to Caddy\">​</a></h4>\n<p>Since I am running all my applications in Docker, I will need something that serves content from the correct container based on the URL that was used to reach the host server.\nAccessing the containers based on their port numbers - e.g. <code>auth.local.bhargav.io:3000</code> is not a feasible solution since I will run into Cross-Origin-Resource-Sharing (CORS) issues later on.\nEvery site has to be served on port 80 for HTTP and 443 for HTTPS.</p>\n<p>Thus we need a reverse proxy that matches the url to the correct docker container running the requested service.\nCaddy is a server that does exactly that.\nIt is simple to use, lightweight and blazingly fast.\nSince it will be running in the Docker environment as well, we need to map each incoming URL to the corresponding docker container.\nFor example:</p>\n<p><code>http://auth.local.bhargav.io</code> → <code>http://auth_frontend:3000</code></p>\n<p><code>http://auth.local.bhargav.io/api/*</code> → <code>http://auth_backend:8000</code></p>\n<p>You can refer to the code in the networking repository for more details of the specifics of the implementation.\nAll the various services are orchestrated in the docker-compose.yml files.</p>\n<h4 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"nextjs-server\">Next.JS Server<a href=\"https://majulahsingapuri.github.io/blog/personal-expenses-pt-2#nextjs-server\" class=\"hash-link\" aria-label=\"Direct link to Next.JS Server\" title=\"Direct link to Next.JS Server\">​</a></h4>\n<p>At this point, our client can query the DNS for the IP of the host server, the request will then reach Caddy who will match the url to the correct docker container.\nNow we just need the container for caddy to serve.</p>\n<p>This is relatively straightforward if you have any experience with Dockerfiles and building and running your own custom containers.\nEssentially what the Dockerfile will do is to spell out steps to create and start our frontend application as its own standalone container.</p>\n<p>We are just going to start off with the default code that comes when setting up Next.js.\nThe Dockerfile is available on the auth frontend repository.\nThis container is then built and orchestrated on the same internal network as Caddy with Docker Compose.</p>\n<table><thead><tr><th style=\"text-align:center\"><img decoding=\"async\" loading=\"lazy\" alt=\"docker-compose.yml\" src=\"https://majulahsingapuri.github.io/assets/images/docker-compose-file-e036b36355739ae0a826c54b333d7adb.png\" width=\"1919\" height=\"978\" class=\"img_ev3q\"></th></tr></thead><tbody><tr><td style=\"text-align:center\"><strong>docker-compose.yml</strong></td></tr></tbody></table>\n<h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"results\">Results<a href=\"https://majulahsingapuri.github.io/blog/personal-expenses-pt-2#results\" class=\"hash-link\" aria-label=\"Direct link to Results\" title=\"Direct link to Results\">​</a></h2>\n<p>Once the containers are built successfully, we can navigate to our auth url and we see the following:</p>\n<table><thead><tr><th style=\"text-align:center\"><img decoding=\"async\" loading=\"lazy\" alt=\"Error Page\" src=\"https://majulahsingapuri.github.io/assets/images/site-cannot-be-reached-253baf64c755a51616ec193c4c40c111.png\" width=\"1915\" height=\"975\" class=\"img_ev3q\"></th></tr></thead><tbody><tr><td style=\"text-align:center\"><strong>Error Page</strong></td></tr></tbody></table>\n<p>Err...\nWhy is the page not being served?</p>\n<p>When running nslookup on the DNS server for a random subdomian vs the auth subdomain, the following happens:</p>\n<table><thead><tr><th style=\"text-align:center\"><img decoding=\"async\" loading=\"lazy\" alt=\"Cannot find auth page\" src=\"https://majulahsingapuri.github.io/assets/images/cannot-find-auth-8831594a67592735b3e68ab28ea4f00e.png\" width=\"518\" height=\"198\" class=\"img_ev3q\"></th></tr></thead><tbody><tr><td style=\"text-align:center\"><strong>Cannot find auth page</strong></td></tr></tbody></table>\n<p>Cannot find IP for auth but can for hello</p>\n<p>This is strange and not supposed to happen.\nThere was no record for hello and yet it was being served.\nThis is something that I still have to look into since I want to be able to finely control the urls that are accesible.</p>\n<p>On the bright side at the very least I can indeed access the host server and display something using a URL.\nI still have some troubleshooting to do and if you have any idea where I went wrong, please do let me know.\nI will send many appreciations your way.</p>\n<p>To end off the week's work, I also set up the backend server in Django, built its Docker container and deployed it in a similar fashion to the auth frontend.\nThe only difference being that now the frontend is the catchall for any url pathways that do not start with /api.</p>\n<h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"conclusion-and-next-steps\">Conclusion and Next Steps<a href=\"https://majulahsingapuri.github.io/blog/personal-expenses-pt-2#conclusion-and-next-steps\" class=\"hash-link\" aria-label=\"Direct link to Conclusion and Next Steps\" title=\"Direct link to Conclusion and Next Steps\">​</a></h2>\n<p>This has been a great weekend thus far, and I wouldn't have thought that I will be able to achieve so much in such short time (literally a day??).\nThe first obvious next step is to figure out why the DNS server is not behaving as it should.\nIs there some other service that is hindering my progress.\nGoing to be using this article to get some idea as to how to solve these issues.</p>\n<p>Once that is resovled, I will look into setting up SSL for the site to ensure that there is a secure connection betweeen my applications and my devices.</p>\n<p>Then I will look at running the services from a computer that is not the one that I am coding on.\nI do have a spare Mac Mini that has been sitting around on my desk for the longest time and it would be great to put it to some use.\nI had recently updated the hard drive from a disk drive to an SSD so that will help things like boot speed.\nSince it is not supported beyond MacOS Catalina, I might just intall Ubuntu on it at the tradeoff of a nicer MacOS UI.\nDecisions.</p>\n<p>The next bit of infra that I need is to set up github actions that run locally on my host machine.\nThis will allow me to push code changes to the repository, run checks and once that is done, I can automatically deploy the changes to the Docker environment without me ever having to manually log into the system and make changes.</p>\n<p>Once that is done, then I can finally move onto writing the applications proper.\nStick around to find out how that turns out.\nUntil next time!</p>\n<p>Found this insightful? Share this with some friends to spread the knowledge!</p>",
            "url": "https://majulahsingapuri.github.io/blog/personal-expenses-pt-2",
            "title": "Personal Expenses Pt. 2",
            "summary": "Some success with this project!",
            "date_modified": "2023-10-19T00:00:00.000Z",
            "author": {
                "name": "Bhargav Singapuri",
                "url": "https://github.com/majulahsingapuri"
            },
            "tags": [
                "infrastructure",
                "architecture",
                "payments",
                "frontend",
                "backend"
            ]
        },
        {
            "id": "https://majulahsingapuri.github.io/blog/personal-expenses-pt-1",
            "content_html": "<p>And so we embark on another project that (hopefully) won't be relegated to the forgotten/abandoned bin.\nThis one though stems from an actual need for me to control my personal cash flows but at the same time, I hope to learn a lot more about Networking, Self-Hosting and Systems Architecture.</p>\n<h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"overview\">Overview<a href=\"https://majulahsingapuri.github.io/blog/personal-expenses-pt-1#overview\" class=\"hash-link\" aria-label=\"Direct link to Overview\" title=\"Direct link to Overview\">​</a></h2>\n<p>First, a little bit about the inspiration for this project.\nEveryone should at some point start to keep track of their finances to be a financially responsible adult.\nAs I have finally entered the workforce and have access to tools like a credit card, it becomes harder to keep track of my spending with multiple avenues for money to exit from my sphere of control.</p>\n<h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"existing-options-and-their-shortfalls\">Existing Options and Their Shortfalls<a href=\"https://majulahsingapuri.github.io/blog/personal-expenses-pt-1#existing-options-and-their-shortfalls\" class=\"hash-link\" aria-label=\"Direct link to Existing Options and Their Shortfalls\" title=\"Direct link to Existing Options and Their Shortfalls\">​</a></h3>\n<p>Like many of us, I have asked around amongst my friends and researched online for great apps that will help me in this area.\nI have also previously been a user of apps like <a href=\"https://seedly.sg/\" target=\"_blank\" rel=\"noopener noreferrer\">Seedly</a> which has allowed me to sync my transactions directly from my bank account but DBS, my primary bank of choice, has <a href=\"https://seedly.sg/posts/hi-is-there-any-update-regarding-syncing-with-dbs-or-this-is-gone-case/\" target=\"_blank\" rel=\"noopener noreferrer\">suspended third-party sync</a>.</p>\n<h4 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"great-features\">Great Features<a href=\"https://majulahsingapuri.github.io/blog/personal-expenses-pt-1#great-features\" class=\"hash-link\" aria-label=\"Direct link to Great Features\" title=\"Direct link to Great Features\">​</a></h4>\n<p>I am currently using <a href=\"https://www.dobin.io/\" target=\"_blank\" rel=\"noopener noreferrer\">Dobin</a>, which is a locally developed application that also has the ability to sync to your bank accounts (including DBS, which I am not sure how they do that).\nThey understand that having multiple accounts will involve some amount of self-transfers between accounts and thus have a handy switch to mark transactions as such and thus they are omitted from cashflow calculations.\nHowever, despite there being a handy \"Net Cashflow\" bar that tells you if you spent more money that month than received, the UI is a bit janky despite the clean look and there is no search function as well to find the transactions that you are looking for.</p>\n<h4 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"digital-wallets\">Digital Wallets<a href=\"https://majulahsingapuri.github.io/blog/personal-expenses-pt-1#digital-wallets\" class=\"hash-link\" aria-label=\"Direct link to Digital Wallets\" title=\"Direct link to Digital Wallets\">​</a></h4>\n<p>The key issue is that there has been a proliferation of digital wallets and since they are separate from the bank accounts that most people have.\nThese wallets do not provide the robust tools that most banks provide to their customers in terms of exporting their data.\nFor example, PayLah! only allows you to export your transactions as a PDF file as compared to a more usable CSV file.\nThis is also true for credit card statements.</p>\n<p>This means that you either have to manually add the transactions to your app, which is ridiculous since the entire thing is an automated system, or be content with just labelling the transaction as a \"Transfer\" or \"Other Income\" when you move money in or out of your wallets respectively.</p>\n<div class=\"theme-admonition theme-admonition-note admonition_xJq3 alert alert--secondary\"><div class=\"admonitionHeading_Gvgb\"><span class=\"admonitionIcon_Rf37\"><svg viewBox=\"0 0 14 16\"><path fill-rule=\"evenodd\" d=\"M6.3 5.69a.942.942 0 0 1-.28-.7c0-.28.09-.52.28-.7.19-.18.42-.28.7-.28.28 0 .52.09.7.28.18.19.28.42.28.7 0 .28-.09.52-.28.7a1 1 0 0 1-.7.3c-.28 0-.52-.11-.7-.3zM8 7.99c-.02-.25-.11-.48-.31-.69-.2-.19-.42-.3-.69-.31H6c-.27.02-.48.13-.69.31-.2.2-.3.44-.31.69h1v3c.02.27.11.5.31.69.2.2.42.31.69.31h1c.27 0 .48-.11.69-.31.2-.19.3-.42.31-.69H8V7.98v.01zM7 2.3c-3.14 0-5.7 2.54-5.7 5.68 0 3.14 2.56 5.7 5.7 5.7s5.7-2.55 5.7-5.7c0-3.15-2.56-5.69-5.7-5.69v.01zM7 .98c3.86 0 7 3.14 7 7s-3.14 7-7 7-7-3.12-7-7 3.14-7 7-7z\"></path></svg></span>note</div><div class=\"admonitionContent_BuS1\"><p>Dobin currently doesn't support manual transactions which is also ridiculous but fair given that they want to be a \"fully automated platform\".</p></div></div>\n<h4 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"group-payments\">Group Payments<a href=\"https://majulahsingapuri.github.io/blog/personal-expenses-pt-1#group-payments\" class=\"hash-link\" aria-label=\"Direct link to Group Payments\" title=\"Direct link to Group Payments\">​</a></h4>\n<p>For me the greatest issue are the times when I go out with friends and end up paying first for the meal, following which everyone will proceed to transfer money to me.\nThis means that the budgets that I have set in my application do not show the reality of how much money that I actually spent as the incoming money transferred by the other people enjoying the meal should offset the payment made by the person that paid first.\nThis is also an issue for things like flights where making group bookings is by one person is the norm.</p>\n<h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"ideal-product\">Ideal Product<a href=\"https://majulahsingapuri.github.io/blog/personal-expenses-pt-1#ideal-product\" class=\"hash-link\" aria-label=\"Direct link to Ideal Product\" title=\"Direct link to Ideal Product\">​</a></h3>\n<p>There will always be some tradeoffs when creating such a personal budgeting application.\nBy having to manually refresh your transactions every time, you might not have a live understanding of your spending as data is not pushed to your app but pulled manually.\nSince statements are created at the end of the month for most digital wallets, they can only be processed once per month.</p>\n<p>The key thing for me personally is that since I mostly make digital transactions as compared to cash transactions, I just want a place for me to see all my transactions for the month and just ensure that I am not blowing my budget at the end of it.\nI think I can reasonably rely on the internal tools of the various banking apps to have some sort of idea of how much I am spending and how much I have left to spend.</p>\n<h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"project-scope\">Project Scope<a href=\"https://majulahsingapuri.github.io/blog/personal-expenses-pt-1#project-scope\" class=\"hash-link\" aria-label=\"Direct link to Project Scope\" title=\"Direct link to Project Scope\">​</a></h2>\n<p>There are going to be multiple moving parts to this project.\nSome of them are infrastructural and will then be reused for future projects while others are dedicated specifically for this project.\nThe end goal of this project is not just the creation of a personal expenses app but also a local applications infrastructure that I can use to create any other application that I want.\nI will refrain from connecting it to the internet for security reasons but that will be in the pipeline when my skills are sufficient for me to handle that.</p>\n<h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"common-infrastructure\">Common Infrastructure<a href=\"https://majulahsingapuri.github.io/blog/personal-expenses-pt-1#common-infrastructure\" class=\"hash-link\" aria-label=\"Direct link to Common Infrastructure\" title=\"Direct link to Common Infrastructure\">​</a></h3>\n<p>I will need to set up the following as common infrastructure:</p>\n<ol>\n<li>Local DNS resolver that points <code>*.local.bhargav.io</code> to all the various services that I will have running on my local network.</li>\n<li>Some sort of Docker environment to run the apps as containers.</li>\n<li>An Auth server that will handle the creation of users and the managing of JWT tokens.</li>\n<li>A message queue that will handle all the synchronisation of user changes and any other app specific processing that might need to be done.</li>\n<li>Some sort of automated deployment pipeline like <code>Github Actions</code> but with the target being my local server rather than some cloud infrastructure.</li>\n</ol>\n<h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"tools\">Tools<a href=\"https://majulahsingapuri.github.io/blog/personal-expenses-pt-1#tools\" class=\"hash-link\" aria-label=\"Direct link to Tools\" title=\"Direct link to Tools\">​</a></h3>\n<h4 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"django\">Django<a href=\"https://majulahsingapuri.github.io/blog/personal-expenses-pt-1#django\" class=\"hash-link\" aria-label=\"Direct link to Django\" title=\"Direct link to Django\">​</a></h4>\n<p>Going back to my comfort zone here, but Django and its amazing Pythonic ways allows me to create the scripts that I need and add in all the plugins that I could ever ask for, including data processing pipelines and machine learning models (if I ever decide to in the future).</p>\n<h4 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"nextjs\">NextJS<a href=\"https://majulahsingapuri.github.io/blog/personal-expenses-pt-1#nextjs\" class=\"hash-link\" aria-label=\"Direct link to NextJS\" title=\"Direct link to NextJS\">​</a></h4>\n<p>This is another classic Web development Framework that I personally love to use that has routing built in so that you can focus on building web pages and their components.\nIt is also built on top of React which is a great framework for building Web apps.</p>\n<h4 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"caddy\">Caddy<a href=\"https://majulahsingapuri.github.io/blog/personal-expenses-pt-1#caddy\" class=\"hash-link\" aria-label=\"Direct link to Caddy\" title=\"Direct link to Caddy\">​</a></h4>\n<p>This will end up being the main tool that I will use to reverse proxy my requests as well as ensure HTTPS on the requests.\nIt is a wonderful lightweight and easy to customise tool that handles a lot of the grunt work behind the scenes and has modules that you can load to add extra functionality instantly.</p>\n<h4 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"rabbitmq\">RabbitMQ<a href=\"https://majulahsingapuri.github.io/blog/personal-expenses-pt-1#rabbitmq\" class=\"hash-link\" aria-label=\"Direct link to RabbitMQ\" title=\"Direct link to RabbitMQ\">​</a></h4>\n<p>This is something new to my repertoire of tools as I have never worked with a message queue before.\nIt will be interesting to figure out how to make it work properly.\nThis might even change in the future if there is a better one that I can use.</p>\n<h4 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"bind9\">Bind9<a href=\"https://majulahsingapuri.github.io/blog/personal-expenses-pt-1#bind9\" class=\"hash-link\" aria-label=\"Direct link to Bind9\" title=\"Direct link to Bind9\">​</a></h4>\n<p>Inspired by <a href=\"https://www.youtube.com/watch?v=syzwLwE3Xq4\" target=\"_blank\" rel=\"noopener noreferrer\">Christian Lempa</a>'s video of a DNS server running in Docker, and the need for me to have some way of resolving my local DNS addresses to the right IP address, I will just be following his tutorials to set up the home networking infrastructure.\nI am not a networking professional but I think it will be interesting to learn how to set up the home network and get the site to work.\nI am also not sure if this component is fully necessary as if Caddy can just broadcast to the whole network where to find the correct Docker containers, that would be great.\nFor now, I will keep it in though.</p>\n<h4 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"docker\">Docker<a href=\"https://majulahsingapuri.github.io/blog/personal-expenses-pt-1#docker\" class=\"hash-link\" aria-label=\"Direct link to Docker\" title=\"Direct link to Docker\">​</a></h4>\n<p>This will be used to host all containers that are running my services as well as the Caddy and DNS instances.\nIt's just a great tool to ensure that all the necessary dependencies for each service are present and do not interfere with other services.</p>\n<h4 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"terraform\">Terraform<a href=\"https://majulahsingapuri.github.io/blog/personal-expenses-pt-1#terraform\" class=\"hash-link\" aria-label=\"Direct link to Terraform\" title=\"Direct link to Terraform\">​</a></h4>\n<p>This will be used to manage all the DNS records in the Bind9 server.</p>\n<h4 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"github-actions-self-hosted\">Github Actions Self-Hosted<a href=\"https://majulahsingapuri.github.io/blog/personal-expenses-pt-1#github-actions-self-hosted\" class=\"hash-link\" aria-label=\"Direct link to Github Actions Self-Hosted\" title=\"Direct link to Github Actions Self-Hosted\">​</a></h4>\n<p>In order for me to package and deploy the services that I am creating quickly and efficiently onto my local network, I will need to run Github Actions on a local runner so that it can easily access the correct docker environment.</p>\n<h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"additional-considerations\">Additional Considerations<a href=\"https://majulahsingapuri.github.io/blog/personal-expenses-pt-1#additional-considerations\" class=\"hash-link\" aria-label=\"Direct link to Additional Considerations\" title=\"Direct link to Additional Considerations\">​</a></h3>\n<p>For now at least I don't want this infrastructure to be exposed to the internet as that will involve adding additional security measures that I feel I am not equipped to handle at this moment.</p>\n<p>Another thing is that I am not sure if putting all the services in Docker will be the right way to go.\nChristian uses Proxmox to run virtual machines that host his applications and services, which might make it easier for the DNS service and Caddy will only have to worry about reverse proxying on individual machines running a frontend and backend each rather than across multiple Docker services.</p>\n<h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"architecture\">Architecture<a href=\"https://majulahsingapuri.github.io/blog/personal-expenses-pt-1#architecture\" class=\"hash-link\" aria-label=\"Direct link to Architecture\" title=\"Direct link to Architecture\">​</a></h3>\n<p>A diagram for what I think is the right solution can be found <a href=\"https://app.eraser.io/workspace/EUfzaziNMmAB5PuOn7YH\" target=\"_blank\" rel=\"noopener noreferrer\">here</a>.\nIt will get updated from time to time as new revisions so it will be helpful for me to learn how things have progressed.</p>\n<h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"project-timeline\">Project Timeline<a href=\"https://majulahsingapuri.github.io/blog/personal-expenses-pt-1#project-timeline\" class=\"hash-link\" aria-label=\"Direct link to Project Timeline\" title=\"Direct link to Project Timeline\">​</a></h2>\n<p>Given that this is a side project for me and will definitely take some time as I have to do my research, I think it will take 6 months or so to be fully set up.\nI estimate that it will be about 3 months or so for me to set up the infrastructure, a month for the Authentication app and 2 months for the expenses app.</p>\n<h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"parting-words\">Parting Words<a href=\"https://majulahsingapuri.github.io/blog/personal-expenses-pt-1#parting-words\" class=\"hash-link\" aria-label=\"Direct link to Parting Words\" title=\"Direct link to Parting Words\">​</a></h2>\n<p>I look forward to getting feedback on this project from people that have walked down this path before, be it improvements that I can make or better ways of achieving what I want to, please feel free to reach out to me at my <a href=\"mailto:hello@bhargav.io\" target=\"_blank\" rel=\"noopener noreferrer\">email</a>.\nI look forward to this journey to see what we can create at the end of it.</p>",
            "url": "https://majulahsingapuri.github.io/blog/personal-expenses-pt-1",
            "title": "Personal Expenses Pt. 1",
            "summary": "Creating a personal expenses tracking application that is individual centric.",
            "date_modified": "2023-10-08T00:00:00.000Z",
            "author": {
                "name": "Bhargav Singapuri",
                "url": "https://github.com/majulahsingapuri"
            },
            "tags": [
                "infrastructure",
                "architecture",
                "payments",
                "frontend",
                "backend"
            ]
        },
        {
            "id": "https://majulahsingapuri.github.io/blog/prompt-engineering",
            "content_html": "<p>As we become increasingly dependant on generative AI tools, it is important for us to understand how they behave in order for us to maximise their usefulness to us.</p>\n<h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"motivation\">Motivation<a href=\"https://majulahsingapuri.github.io/blog/prompt-engineering#motivation\" class=\"hash-link\" aria-label=\"Direct link to Motivation\" title=\"Direct link to Motivation\">​</a></h2>\n<p>I was listening to a <a href=\"https://youtu.be/S_E4t7tWHUY?t=3361\" target=\"_blank\" rel=\"noopener noreferrer\">Jordan Peterson Podcast</a> on Computerised Intelligence and the guest, Brian Rommele, talked about how Jordan as a clinical psychologist is better suited to be a prompt engineer then him as a computer scientist.\nThis is likely due to the fact that these models deal with language and Jordan's command of language as well as his ability to extract information will be far superior to someone that designed the model.</p>\n<p>I feel that I myself would run into such issues as a tech person as we have spent most of our life Googling and the key difference between a novice and pro user of Google is that we are able to key in the key terms that we know will get us the answer rather than a question that we ask to the search engine, as backed up by <a href=\"https://doi.org/10.1016/S1389-1286(00)00031-1\" target=\"_blank\" rel=\"noopener noreferrer\">this study</a>.\nThus being able to ask such a model to generate results specific to our use case might be difficult as someone that is trained to search efficiently.</p>\n<h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"creating-this-site\">Creating this Site<a href=\"https://majulahsingapuri.github.io/blog/prompt-engineering#creating-this-site\" class=\"hash-link\" aria-label=\"Direct link to Creating this Site\" title=\"Direct link to Creating this Site\">​</a></h2>\n<p>As I was in the midst of creating this site and having idea how designing beautiful and impactful websites works, I decided to leverage the power of ChatGPT to make me sound more professional than I might actually be.\nSince it is just a personal site and this is all for learning, I thought I'd give this a shot.</p>\n<p>I remember coming across a video (sadly I can't remember the link :smiling_face_with_tear:) a while ago that emphasised the need to ask the model to ask you questions for context that it needs in order for it to understand what it is that you are looking to do.\nThis allows it to learn some key details that will allow the model to curate what it says to you rather than just give some generic answer that won't suit your needs.</p>\n<p>The key things that I wanted ChatGPT to generate for me was the Hero as well as the top skills that I have in a professional voice.</p>\n<h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"setup-prompt\">Setup Prompt<a href=\"https://majulahsingapuri.github.io/blog/prompt-engineering#setup-prompt\" class=\"hash-link\" aria-label=\"Direct link to Setup Prompt\" title=\"Direct link to Setup Prompt\">​</a></h2>\n<p>The prompt below is as close to the one in the video that I saw and it goes something like</p>\n<blockquote>\n<p>In a moment, I will ask you to generate a Hero title and Hero subtitle for a website that is meant to showcase my professional skills and and talents as someone that works in the technology field.\nBefore we do that, I want you to ask me questions to do your best to try and understand what it is that I do and use that knowledge to generate the title and subtitle when you feel you have understood me adequately.</p>\n</blockquote>\n<p>The prompt gives the model the overarching context (what it has to do and what is the tone of voice it must take) as well as a direction (someone in the technology field) so that it can tailor the questions that it asks.\nTo my surprise, that actually worked and it generated the following response</p>\n<blockquote>\n<ol>\n<li>What specific area(s) of technology do you specialize in?</li>\n<li>What is your educational background related to your field?</li>\n<li>How many years of experience do you have in the technology industry?</li>\n<li>Can you tell me about any notable projects or achievements you've had in your career?</li>\n<li>Do you have any particular skills, programming languages, or software tools that you excel in?</li>\n<li>Are there any specific industries or sectors where you have worked extensively?</li>\n<li>What sets you apart from others in your field? Is there something unique or distinctive about your approach or expertise?</li>\n<li>Are there any specific values or principles that guide your work in the technology field?</li>\n<li>Is there a particular message or impression you would like your website visitors to have about your skills and talents?</li>\n</ol>\n</blockquote>\n<h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"content-generation\">Content Generation<a href=\"https://majulahsingapuri.github.io/blog/prompt-engineering#content-generation\" class=\"hash-link\" aria-label=\"Direct link to Content Generation\" title=\"Direct link to Content Generation\">​</a></h2>\n<p>Upon <a href=\"https://majulahsingapuri.github.io/blog/prompt-engineering#appendix\">answering the questions above</a> the model felt that it was satisfied with my answers and it had enough context to start generating what I had asked it to.\nIt is important to remember that the questions have to be answered in as much detail as possible.\nIt is ok to skip questions that are not relevant or just indicate that to the model.</p>\n<p>This is in some part a <a href=\"https://en.wikipedia.org/wiki/Rocchio_algorithm\" target=\"_blank\" rel=\"noopener noreferrer\">Rocchio Algorithm</a> where you are nudging the model closer and closer to what you actually want it to do.\nI guess understanding search engines goes some way in understanding how these models work as well.</p>\n<h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"hero\">Hero<a href=\"https://majulahsingapuri.github.io/blog/prompt-engineering#hero\" class=\"hash-link\" aria-label=\"Direct link to Hero\" title=\"Direct link to Hero\">​</a></h3>\n<p>The following was the Hero that was generated with a handy explanation of why it did so</p>\n<blockquote>\n<p>Title: \"Transforming Industries with Technology and Data Insights\"</p>\n<p>Subtitle: \"Full Stack Software Engineer | AI &amp; Machine Learning Specialist\"</p>\n<p>This title and subtitle showcase your expertise in both full stack software engineering and artificial intelligence/machine learning. It highlights your ability to leverage technology and data insights to drive transformation in industries. The subtitle emphasizes your specific skills and areas of specialization, positioning you as a professional who excels in both developing robust software solutions and applying advanced AI techniques.</p>\n</blockquote>\n<h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"skillset\">Skillset<a href=\"https://majulahsingapuri.github.io/blog/prompt-engineering#skillset\" class=\"hash-link\" aria-label=\"Direct link to Skillset\" title=\"Direct link to Skillset\">​</a></h3>\n<p>Now that I know that the model had adequately understood the context that I had provided to it for it to be able to generate what I was looking for, I asked it to generate my top skills as well as a short description of them.\nI purposely put a word limit on it so that when you the viewer looks at the site, you are able to grasp the information without being overwhelmed by a wall of text.</p>\n<p>The following is the prompt that I asked the model</p>\n<blockquote>\n<p>Next, I want you to write 6 of my best skills, qualities or any other piece of information in no more than 3 words and a short description of the skill or quality in no more than 15 words in a tabular format</p>\n</blockquote>\n<p>And the following was what was generated</p>\n<table><thead><tr><th>Skill/Quality</th><th>Description</th></tr></thead><tbody><tr><td>Full Stack</td><td>Proficient in web development using React and Django.</td></tr><tr><td>AI &amp; ML</td><td>Experienced in AI and ML frameworks like PyTorch, TensorFlow, and WandB.</td></tr><tr><td>Python</td><td>Strong command of Python programming language for versatile development.</td></tr><tr><td>Team Player</td><td>Collaborative and effective in working within diverse teams.</td></tr><tr><td>Data Insights</td><td>Expertise in extracting valuable insights from complex datasets.</td></tr><tr><td>Thought Leader</td><td>Respected for industry knowledge and sharing innovative ideas.</td></tr></tbody></table>\n<p>We can see that for the technical skills, it mostly just did some rewording of what I had told it but in my opinion it performed a lot better for the soft skills that it generated.\nIt is also neat that it generated an equal split of the two kinds of skills (hard and soft).</p>\n<p>Of course with any output generated by such models, it is up to the human to keep what's useful and discard the rest.\nIf you see the <a href=\"https://majulahsingapuri.github.io/\">homepage</a> of my site, you will see that there have been edits made to the results generated, mostly for succinctness.</p>\n<h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"conclusion\">Conclusion<a href=\"https://majulahsingapuri.github.io/blog/prompt-engineering#conclusion\" class=\"hash-link\" aria-label=\"Direct link to Conclusion\" title=\"Direct link to Conclusion\">​</a></h2>\n<p>This has been my first proper foray into using ChatGPT for an actual purpose.\nWhile there are so many people out there, especially content creators that are using this as a way to speed up their efficiency or to delegate tasks, I see that there is a greater potential to be found in the model.</p>\n<p>In his podcast, Jordan also talks about how there is a creative element to be found in these models which will require some poking and prodding by the prompter to get a decently good response.\nI hope that this post has been informative in some way that will help you to leverage this tool for your own uses.</p>\n<h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"appendix\">Appendix<a href=\"https://majulahsingapuri.github.io/blog/prompt-engineering#appendix\" class=\"hash-link\" aria-label=\"Direct link to Appendix\" title=\"Direct link to Appendix\">​</a></h2>\n<ol>\n<li>I specialise in Full Stack Software Engineering such as web development with React, backend development with Django and cloud orchestration with Terraform. I also specialise in Artificial Intelligence and Machine Learning with tools such as Pytorch, Tensorflow and WandB.</li>\n<li>I just finished my bachelors in Data Science and Artificial Intelligence which is a mixed discipline degree between computing and mathematical sciences where we learn topics like data structures and algorithms as well as probability, statistics and multivariate analysis.</li>\n<li>I have 2 years of internship experience in the industry</li>\n<li>I have created a Industry Classifier using a Natural Language model for a venture capital company during my final year project in school that performed well and improved the company's efficiency when scouting for potential companies to invest in.</li>\n<li>I excel particularly in the Python and Typescript programming languages but I know other languages and can pick up new ones fairly quickly. I am familiar with the Django backend and React Frontend tools as well as Terraform for creating and managing cloud infrastructure resources. I am also a team player that can get the job done well and on time.</li>\n<li>I have mostly worked in the private equity and finance fields</li>\n<li>Most of my peers either have experience only with software engineering or with data analytics but not both at the same time. I have also lead teams larger in scale and impact than most of my peers in the same age or job title bracket.</li>\n<li>The main thing that guides my work is that i want to learn as much as i can from those around me and have as much impact as i can to those that benefit from my work. I strive to keep up to date with the latest developments in the field and apply as much as i can to my work</li>\n<li>I want the visitors to know that i am a dependable and trustworthy individual that is skilled in his work and is a thought leader for the topics that he talks about</li>\n</ol>",
            "url": "https://majulahsingapuri.github.io/blog/prompt-engineering",
            "title": "Prompt Engineering for Context Understanding",
            "summary": "How to make ChatGPT understand you.",
            "date_modified": "2023-05-31T00:00:00.000Z",
            "author": {
                "name": "Bhargav Singapuri",
                "url": "https://github.com/majulahsingapuri"
            },
            "tags": [
                "prompt engineering",
                "chatgpt",
                "ai",
                "website"
            ]
        },
        {
            "id": "https://majulahsingapuri.github.io/blog/hello-world",
            "content_html": "<p>Hello one and all!</p>\n<h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"introduction\">Introduction<a href=\"https://majulahsingapuri.github.io/blog/hello-world#introduction\" class=\"hash-link\" aria-label=\"Direct link to Introduction\" title=\"Direct link to Introduction\">​</a></h2>\n<p>I am Bhargav, a fresh graduate from NTU and this blog is my attempt to document all my learnings so that I can share them with everyone.\nThe main aim of this site is for me to share a bit about myself as well as for me to document the work that I do so that you can join me on my journey as a Data Scientist / Software Engineer as I tackle problems at work or in my own personal projects.\nBy doing this, I hope that we can learn interesting things together and that I can easily recall what I did previously should I need to.</p>\n<h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"background\">Background<a href=\"https://majulahsingapuri.github.io/blog/hello-world#background\" class=\"hash-link\" aria-label=\"Direct link to Background\" title=\"Direct link to Background\">​</a></h2>\n<p>I started my Coding journey back in Secondary school and from the first day knew that I wanted to become someone that codes for a living.\nAlthough I didn't have a clue as to what that would entail, the thought of giving instructions to a computer and have it solve problems was thrilling.</p>\n<p>I started off my journey by participating in the <a href=\"https://noisg.comp.nus.edu.sg/noi/\" target=\"_blank\" rel=\"noopener noreferrer\">National Olympiad of Informatics</a> and was immediately thrown into the deep end of algorithms.\nAlthough I did not understand much of what was going on, being able to at least solve some of the easier questions piqued my interest in the area and drove me to pursue the field further.</p>\n<h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"college\">College<a href=\"https://majulahsingapuri.github.io/blog/hello-world#college\" class=\"hash-link\" aria-label=\"Direct link to College\" title=\"Direct link to College\">​</a></h2>\n<p>In University I studied <a href=\"https://www.ntu.edu.sg/education/undergraduate-programme/bachelor-of-science-in-data-science-artificial-intelligence\" target=\"_blank\" rel=\"noopener noreferrer\">Data Science and Artificial Intelligence</a> at NTU Singapore.\nThis was a slight deviation from my pure computer science inclination as I saw the growing importance of data in the current day and really wanted something that would combine my interests in math and coding.</p>\n<h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"competitions\">Competitions<a href=\"https://majulahsingapuri.github.io/blog/hello-world#competitions\" class=\"hash-link\" aria-label=\"Direct link to Competitions\" title=\"Direct link to Competitions\">​</a></h3>\n<p>Unfortunately due to COVID, a lot of my school experience was cut short and I was unable to join many school related activities that might have bolstered my learning such as hackathons and school clubs.\nDespite that, I did manage to join a handful such as <a href=\"https://hacknroll.nushackers.org/\" target=\"_blank\" rel=\"noopener noreferrer\">NUS Hacknroll</a> and <a href=\"https://readytradergo.optiver.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Optiver's Ready Trader Go</a>.\nMost of these were for the experience and to have some fun with friends rather than to actually win the competition but they were good experiences nonetheless.</p>\n<h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"internship\">Internship<a href=\"https://majulahsingapuri.github.io/blog/hello-world#internship\" class=\"hash-link\" aria-label=\"Direct link to Internship\" title=\"Direct link to Internship\">​</a></h3>\n<p>During my time at school, I interned at <a href=\"https://upskills.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Upskills Pte. Ltd</a> for 3 months, as well as <a href=\"https://vertexholdings.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Vertex Holdings Pte. Ltd</a> for 15 months.\nThe latter being a part of <a href=\"https://www.skillsfuture.gov.sg/workstudy/wsdeg\" target=\"_blank\" rel=\"noopener noreferrer\">Work Study Degree Programme</a> where I had to do an extensive internship and a Final Year Project with the company.</p>\n<p>You can read more details on my experiences in the <a href=\"https://majulahsingapuri.github.io/projects/\">Projects</a> Section.</p>\n<h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"work\">Work<a href=\"https://majulahsingapuri.github.io/blog/hello-world#work\" class=\"hash-link\" aria-label=\"Direct link to Work\" title=\"Direct link to Work\">​</a></h2>\n<p>Now that I have completed University, I will be working at UOB Group's Technology Department as a Software Engineer.\nI look forward to solving interesting challenges that the bank faces and helping them to build up their infrastructure.</p>\n<p>Beyond that, I also look forward to working on my own projects that I can hopefully use in my daily life to make it just that much more easier and that I can share my journey of making these projects with you.</p>\n<p>See you around!</p>",
            "url": "https://majulahsingapuri.github.io/blog/hello-world",
            "title": "Hello World!",
            "summary": "My first foray into creating a site.",
            "date_modified": "2023-05-25T00:00:00.000Z",
            "author": {
                "name": "Bhargav Singapuri",
                "url": "https://github.com/majulahsingapuri"
            },
            "tags": [
                "hello"
            ]
        }
    ]
}